#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.xc_lb.data.http.api-spec will be read during apply
  # (config refers to values not yet known)
 <= data "http" "api-spec" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + request_headers      = {
          + "Accept"        = "application/json"
          + "Authorization" = (known after apply)
        }
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://f5-emea-ent.console.ves.volterra.io/api/object_store/namespaces/s-archer/stored_objects/swagger"

      + retry {
          + attempts     = (known after apply)
          + max_delay_ms = (known after apply)
          + min_delay_ms = (known after apply)
        }
    }

  # module.xc_lb.restful_resource.api-spec will be created
  + resource "restful_resource" "api-spec" {
      + body          = {
          + content_format = "json"
          + name           = "arch-nocode-usergroup-1"
          + namespace      = "s-archer"
          + object_type    = "swagger"
          + string_value   = jsonencode(
                {
                  + components = {
                      + schemas         = {
                          + Order             = {
                              + properties = {
                                  + cid            = {
                                      + example     = "JS0815DE"
                                      + type        = "string"
                                      + uniqueItems = true
                                    }
                                  + orderLines     = {
                                      + "$ref" = "#/components/schemas/OrderLines"
                                    }
                                  + orderLinesData = {
                                      + "$ref" = "#/components/schemas/OrderLinesData"
                                    }
                                }
                              + required   = [
                                  + "cid",
                                ]
                            }
                          + OrderConfirmation = {
                              + properties = {
                                  + cid        = {
                                      + example     = "JS0815DE"
                                      + type        = "string"
                                      + uniqueItems = true
                                    }
                                  + orderNo    = {
                                      + example     = "3d06ac5e1bdf39d26392f8100f124742"
                                      + type        = "string"
                                      + uniqueItems = true
                                    }
                                  + paymentDue = {
                                      + description = "All payments are due 14 days after order placement"
                                      + example     = "2018-01-19T07:02:06.800Z"
                                      + format      = "date"
                                      + type        = "string"
                                    }
                                }
                              + required   = [
                                  + "cid",
                                  + "orderNo",
                                  + "paymentDue",
                                ]
                            }
                          + OrderLine         = {
                              + description = "Order line in default JSON format"
                              + properties  = {
                                  + customerReference = {
                                      + example = "PO0000001"
                                      + type    = "string"
                                    }
                                  + productId         = {
                                      + example = 8
                                      + type    = "integer"
                                    }
                                  + quantity          = {
                                      + example = 500
                                      + minimum = 1
                                      + type    = "integer"
                                    }
                                }
                              + required    = [
                                  + "productId",
                                  + "quantity",
                                ]
                            }
                          + OrderLines        = {
                              + items = {
                                  + "$ref" = "#/components/schemas/OrderLine"
                                }
                              + type  = "array"
                            }
                          + OrderLinesData    = {
                              + description = "Order line(s) in customer specific JSON format"
                              + example     = jsonencode(
                                    [
                                      + {
                                          + couponCode        = "pes[Bh.u*t"
                                          + customerReference = [
                                              + "PO0000001.2",
                                              + "SM20180105|042",
                                            ]
                                          + productId         = 12
                                          + quantity          = 10000
                                        },
                                      + {
                                          + customerReference = "PO0000003.4"
                                          + productId         = 13
                                          + quantity          = 2000
                                        },
                                    ]
                                )
                              + type        = "string"
                            }
                        }
                      + securitySchemes = {
                          + bearerAuth = {
                              + bearerFormat = "JWT"
                              + scheme       = "bearer"
                              + type         = "http"
                            }
                        }
                    }
                  + info       = {
                      + description = "New & secure JSON-based API for our enterprise customers. (Deprecates previously offered XML-based endpoints)"
                      + license     = {
                          + name = "MIT"
                          + url  = "https://opensource.org/licenses/MIT"
                        }
                      + title       = "NextGen B2B API"
                      + version     = "3.0.0"
                    }
                  + openapi    = "3.0.0"
                  + paths      = {
                      + "/orders" = {
                          + post = {
                              + description = "Create new customer order"
                              + requestBody = {
                                  + content     = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/Order"
                                            }
                                        }
                                    }
                                  + description = "Customer order to be placed"
                                }
                              + responses   = {
                                  + "200" = {
                                      + content     = {
                                          + "application/json" = {
                                              + schema = {
                                                  + "$ref" = "#/components/schemas/OrderConfirmation"
                                                }
                                            }
                                        }
                                      + description = "New customer order is created"
                                    }
                                }
                              + tags        = [
                                  + "Order",
                                ]
                            }
                        }
                    }
                  + security   = [
                      + {
                          + bearerAuth = []
                        },
                    ]
                  + servers    = [
                      + {
                          + url = "/b2b/v2"
                        },
                    ]
                  + tags       = [
                      + {
                          + description = "API for customer orders"
                          + name        = "Order"
                        },
                    ]
                }
            )
        }
      + create_method = "PUT"
      + delete_path   = "/object_store/namespaces/s-archer/stored_objects/swagger/arch-nocode-usergroup-1/$(body.metadata.version)"
      + header        = {
          + "Content-Type" = "application/json"
        }
      + id            = (known after apply)
      + output        = (known after apply)
      + path          = "/object_store/namespaces/s-archer/stored_objects/swagger/arch-nocode-usergroup-1"
      + poll_create   = {
          + default_delay_sec = 10
          + status            = {
              + success = "200"
            }
          + status_locator    = "code"
        }
      + poll_delete   = {
          + default_delay_sec = 10
          + status            = {
              + success = "404"
            }
          + status_locator    = "code"
        }
      + read_path     = "/object_store/namespaces/s-archer/stored_objects/swagger/arch-nocode-usergroup-1/$(body.metadata.version)"
      + update_path   = "/object_store/namespaces/s-archer/stored_objects/swagger/arch-nocode-usergroup-1"
    }

  # module.xc_lb.volterra_api_credential.api-creds will be created
  + resource "volterra_api_credential" "api-creds" {
      + api_credential_type          = "API_TOKEN"
      + automatic_approval_api_token = false
      + created_at                   = (known after apply)
      + data                         = (known after apply)
      + expiration_timestamp         = (known after apply)
      + expiry_days                  = 10
      + id                           = (known after apply)
      + name                         = "arch-nocode-usergroup-1"
    }

  # module.xc_lb.volterra_api_definition.api-def will be created
  + resource "volterra_api_definition" "api-def" {
      + id                   = (known after apply)
      + name                 = "arch-nocode-usergroup-1"
      + namespace            = "s-archer"
      + strict_schema_origin = true
      + swagger_specs        = (known after apply)
    }

  # module.xc_lb.volterra_app_firewall.recommended will be created
  + resource "volterra_app_firewall" "recommended" {
      + allow_all_response_codes   = true
      + blocking                   = true
      + default_anonymization      = true
      + default_detection_settings = true
      + id                         = (known after apply)
      + name                       = "arch-nocode-usergroup-1"
      + namespace                  = "shared"
      + use_default_blocking_page  = true
    }

  # module.xc_lb.volterra_healthcheck.healthcheck will be created
  + resource "volterra_healthcheck" "healthcheck" {
      + healthy_threshold   = 3
      + id                  = (known after apply)
      + interval            = 15
      + name                = "arch-nocode-usergroup-1"
      + namespace           = "s-archer"
      + timeout             = 3
      + unhealthy_threshold = 1

      + http_health_check {
          + headers                   = {
              + "Connection" = "close"
            }
          + path                      = "/"
          + request_headers_to_remove = [
              + "user-agent",
            ]
          + use_http2                 = false
          + use_origin_server_name    = true
        }
    }

  # module.xc_lb.volterra_http_loadbalancer.lb will be created
  + resource "volterra_http_loadbalancer" "lb" {
      + add_location                    = true
      + cname                           = (known after apply)
      + description                     = "Pattern A1 TF deployment zero-code module"
      + domains                         = [
          + "nocode.f5xc.co.uk",
        ]
      + enable_malicious_user_detection = true
      + enable_threat_mesh              = true
      + id                              = (known after apply)
      + name                            = "arch-nocode-usergroup-1"
      + namespace                       = "s-archer"

      + api_specification {
          + api_definition {
              + name      = "arch-nocode-usergroup-1"
              + namespace = "s-archer"
              + tenant    = "f5-emea-ent-bceuutam"
            }

          + validation_all_spec_endpoints {
              + fall_through_mode {
                  + fall_through_mode_allow = true
                }

              + settings {
                  + oversized_body_skip_validation       = true
                  + property_validation_settings_default = true
                }

              + validation_mode {

                  + validation_mode_active {
                      + enforcement_block             = true
                      + request_validation_properties = [
                          + "PROPERTY_PATH_PARAMETERS",
                          + "PROPERTY_QUERY_PARAMETERS",
                          + "PROPERTY_HTTP_HEADERS",
                        ]
                    }
                }
            }
        }

      + app_firewall {
          + name      = "arch-nocode-usergroup-1"
          + namespace = "shared"
          + tenant    = "f5-emea-ent-bceuutam"
        }

      + default_route_pools {

          + pool {
              + kind      = (known after apply)
              + name      = "arch-nocode-usergroup-1"
              + namespace = "s-archer"
              + tenant    = "f5-emea-ent-bceuutam"
            }
        }

      + enable_api_discovery {
          + disable_learn_from_redirect_traffic = true

          + api_crawler {
              + api_crawler_config {
                  + domains {
                      + domain = "nocode.f5xc.co.uk"

                      + simple_login {
                          + user = "user123"

                          + password {

                              + clear_secret_info {
                                  + url = "string:///dGVzdDEyMw=="
                                }
                            }
                        }
                    }
                }
            }

          + discovered_api_settings {
              + purge_duration_for_inactive_discovered_apis = 2
            }
        }

      + enable_challenge {
        }

      + enable_ip_reputation {
          + ip_threat_categories = [
              + "SPAM_SOURCES",
              + "WINDOWS_EXPLOITS",
              + "WEB_ATTACKS",
              + "BOTNETS",
              + "SCANNERS",
              + "REPUTATION",
              + "PROXY",
              + "MOBILE_THREATS",
              + "TOR_PROXY",
              + "DENIAL_OF_SERVICE",
              + "NETWORK",
              + "PHISHING",
            ]
        }

      + https_auto_cert {
          + add_hsts      = true
          + http_redirect = true
          + port          = 443

          + tls_config {
              + default_security = true
            }
        }

      + user_identification {
          + name      = "arch-nocode-usergroup-1"
          + namespace = "shared"
          + tenant    = "f5-emea-ent-bceuutam"
        }
    }

  # module.xc_lb.volterra_origin_pool.origin will be created
  + resource "volterra_origin_pool" "origin" {
      + description            = "Pattern A1 TF deployment zero-code module"
      + endpoint_selection     = "LOCAL_PREFERRED"
      + id                     = (known after apply)
      + loadbalancer_algorithm = "LB_OVERRIDE"
      + name                   = "arch-nocode-usergroup-1"
      + namespace              = "s-archer"
      + port                   = 443

      + healthcheck {
          + name      = "arch-nocode-usergroup-1"
          + namespace = "s-archer"
        }

      + origin_servers {

          + private_ip {
              + inside_network = true
              + ip             = "10.0.103.114"

              + site_locator {
                  + site {
                      + kind      = (known after apply)
                      + name      = "arch-aws-juice-site"
                      + namespace = "system"
                    }
                }
            }
        }
      + origin_servers {

          + private_ip {
              + inside_network = true
              + ip             = "10.0.103.36"

              + site_locator {
                  + site {
                      + kind      = (known after apply)
                      + name      = "arch-aws-juice-site"
                      + namespace = "system"
                    }
                }
            }
        }

      + use_tls {
          + no_mtls                  = true
          + skip_server_verification = true
          + use_host_header_as_sni   = true

          + tls_config {
              + default_security = true
            }
        }
    }

  # module.xc_lb.volterra_user_identification.recommended will be created
  + resource "volterra_user_identification" "recommended" {
      + id        = (known after apply)
      + name      = "arch-nocode-usergroup-1"
      + namespace = "shared"

      + rules {
          + ip_and_ja4_tls_fingerprint = true
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + domain = "nocode.f5xc.co.uk"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @s-archer, Action: `pull_request`*